#1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
# def divide_numb(a, b):
#     x = a / b
#     if b == 0:
#         print('Делить на ноль нельзя')
#     else:
#         print(x)
# divide_numb(int(input()), int(input()))

#2. Выполнить функцию, которая принимает несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы. Осуществить вывод данных о пользователе одной строкой.
# def User_Info(**base):
#     for char,log in base.items():
#       print(f"{char}: {log}", end='; ')
# User_Info(name="Zinedine", family="Zidane", year_of_birth="1972", city="Madrid", email="Zidane@molodec.eu", phonenumber="8999888999111")

#3. Реализовать функцию my_func(), которая принимает три позиционных аргумента и возвращает сумму наибольших двух аргументов.
# def my_func(a, b, c):
#     if a <= b and a <= c:
#         x = b + c
#     elif b <= a and b <= c:
#         x = a + c
#     else:
#         x = a + b
#     print(x)
# my_func(4,8,16)
# my_func(5,5,6)
# my_func(8,8,7)
# my_func(8,4,16)
# my_func(16,8,4)
#4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Выполните возведение числа x в степень y. Задание реализуйте в виде функции my_func(x, y).
# При решении задания нужно обойтись без встроенной функции возведения числа в степень.
# def my_func(x, y):
#     k = 1
#     for i in range(1, (-1)*y + 1):
#         k = k / x
#     print(k)
# my_func(float(input('Введите действительное положительное число x: ')), int(input('Введите целое отрицательное число y: ')))

#5. Программа запрашивает у пользователя строку чисел, разделённых пробелом. При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделённых пробелом и снова нажать Enter.
# Сумма вновь введённых чисел будет добавляться к уже подсчитанной сумме.
#Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введён после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.
# def my_func():
#     sum = 0
#     while True:
#         a = input('Введите число через пробел, для выхода - $: ').split()
#         for i in a:
#             if i != '$':
#                 sum = sum + int(i)
#             elif '$' in a:
#                 print(sum)
#                 return
#         print(sum)
# my_func()

#6. Реализовать функцию int_func(), принимающую слова из маленьких латинских букв и возвращающую их же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# def int_func(n):
#     sum = 1
#     for i in n:
#         if i in 'qwertyuioplkjhgfdsazxcvbnm':
#             sum = sum + 1
#     if sum == len(n):
#         print(n)
#     else:
#         print('Будь внимательнее...')
# int_func(input('Введите слово из маленьких латинских букв: ').capitalize())

#7. Продолжить работу над заданием. В программу должна попадать строка из слов, разделённых пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
# Нужно сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы. Используйте написанную ранее функцию int_func().
# def int_func(n):
#     sum = 0
#     x = n.split()
#     k = list(n)
#     for i in range(len(k)):
#         if k[i] in ' qwertyuioplkjhgfdsazxcvbnm':
#             sum = sum + 1
#     if sum == len(k):
#         for j in x:
#             print(j.capitalize(), end = ' ')
#     else:
#         print('Будь внимательнее...')
# int_func(input('Введите слово из маленьких латинских букв: '))

